# git init - инициазирует проэкт. Она создает в вашем проекте файл . git.

# git add - этоткоманда добавляет файлы которые нужно отправить на удаленный репозиторий

# git commit - m 'комментарий' - в  этом коммите будут храниться все ваши файлы которые вы добавили

# git push origin название ветки - данная команда отправляет ваш коммит на удаленный репозиторий

# git status - она показывает статус файла в проекте

# git branch - показывает список веток

# git branch название ветки - создаем ветку 

# git checkout название ветки - переключение между ветками 



